from src.test_cases import *
from src.data_models.项目信息数据 import 专项层级Data
from src.test_cases.项目管理.conftest import (
    build_附件类型配置,
    项目类型创建,
    delete_database_项目类型,
)


@用例名称("专项项目层级配置新增下级")
@用例描述(
    """
1.新增具有专业层级的的项目类型
2.新增下级
3.校验与删除项目类型
"""
)
@用例级别(普通)
def test_专项项目层级配置_新增下级(oc_page, test_name, 专项项目层级配置_项目类型):
    with 测试步骤("数据初始化"):
        项目类型名称, 项目类型code = 专项项目层级配置_项目类型
        下级信息 = {
            "下级信息": 专项层级Data(
                层级名称=f"自动化创建_层级名称_新增下级_{faker_随机数生成(4)}",
                归口部门="福建省妇幼保健院",
                责任人="一级部门A_负责人",
                汇总人="一级部门A_负责人",
                审批人="一级部门A_负责人",
                审批流程="立项论证流程",
            ).as_dict()
        }
        层级名称 = 下级信息["下级信息"]["层级名称"]
    with 测试步骤("切换到用户管理人员,并跳转专项项目层级配置"):
        oc_page.专项项目层级配置页.set_设置当前用户为("superAdmin")
        oc_page.专项项目层级配置页.navigate()
    with 测试步骤("新增项目层级"):
        oc_page.专项项目层级配置页.click_处理定位(项目类型名称)
        oc_page.专项项目层级配置页.fill_新增专项层级(下级信息["下级信息"])
    with 测试步骤("检验新增的下级并删除项目类型"):
        table_dict = oc_page.专项项目层级配置页.search_下级信息(项目类型名称, 层级名称)
        assert compare_dicts(
            dict1=下级信息["下级信息"],
            dict2=table_dict,
            strict=False,
            keys=["层级名称", "归口部门"],
        )
        delete_database_项目类型(项目类型code)


@pytest.fixture
def 专项项目层级配置_项目类型(oc_page, 关联预算事项):
    项目类型配置 = {
        "基本信息": {
            "项目类型编码": f"AUTO{faker_随机数生成(8)}",
            "项目类型": f"自动化_项目类型(多级)_{faker_随机数生成(4)}",
            "归口部门": "一级部门&&测试机构(勿删)",
            "是否分层级项目": "是",
            "关联预算事项": 关联预算事项.get("事项编码"),
            "是否启用": "是",
            "是否末级": "是",
        },
        "项目管理流程": [
            {
                "项目总预算下限金额（万元）": "10000",
                "项目总预算上限金额（万元）": "30000",
                "项目管理流程": "项目可行性研究报告&&项目概算",
            }
        ],
        "任务阶段": [{"任务阶段名称": f"第{i}阶段"} for i in range(1, 4)],
        "附件类型配置": [build_附件类型配置()],
    }
    项目类型创建(oc_page, 项目类型配置)
    yield 项目类型配置["基本信息"]["项目类型"], 项目类型配置["基本信息"][
        "项目类型编码"
    ],
