from src.test_cases import *
from src.test_cases.项目管理.conftest import fill_项目立项, add_汇总项目_项目类型


@用例名称("多个项目项目汇总")
@用例描述(
    """
用户可对项目类型为“双高项目”且选择项目层级的项目进行汇总，将几个项目汇总为一个项目
测试步骤:
1. 创建多个双高项目且未分级项目
2. 项目汇总
5. 验证汇总结果
"""
)
@用例级别(严重)
def test_项目汇总(oc_page, oc_page_backup, 关联预算事项, 基础配置):
    with 测试步骤("创建层级项目"):
        用户名 = "Atest10"
        汇总项目类型 = add_汇总项目_项目类型(oc_page, 关联预算事项, 用户名)
        指标数据 = 基础配置["绩效指标库"]
    with 测试步骤("创建预算项目并审批通过"):
        汇总立项info01 = {
            "基本信息": 项目立项基本信息Data(
                项目类型=汇总项目类型,
                实施部门="一级部门",
                经费类型="创收经费",
                项目层级=汇总项目类型,
                是否政府投资类="否",
                项目负责人=用户名,
                立项方式="年度统一立项",
                专项项目="双高计划项目",
            ).as_dict(),
            "立项信息": 立项信息Data().as_dict(),
            "绩效目标": 绩效目标Data(
                产出指标=指标数据["产出指标"][:1],
                效益指标=指标数据["效益指标"][:1],
                满意度指标=指标数据["满意度指标"][:1],
            ).as_dict(),
            "预算明细": 预算明细Data().as_dict(),
        }
        基本信息 = 汇总立项info01["基本信息"]
        logger.info(f"项目立项开启论证:{汇总立项info01}")
        项目立项01 = fill_项目立项(oc_page, oc_page_backup, 基本信息, 汇总立项info01, 用户名)
    with 测试步骤("创建绩效项目并审批通过"):
        汇总立项info02 = {
            "基本信息": 项目立项基本信息Data(
                项目类型=汇总项目类型,
                实施部门="一级部门",
                经费类型="创收经费",
                项目层级=汇总项目类型,
                是否政府投资类="否",
                项目负责人=用户名,
                立项方式="临时立项",
                专项项目="创新强校项目",
            ).as_dict(),
            "立项信息": 立项信息Data().as_dict(),
            "绩效目标": 绩效目标Data(
                产出指标=指标数据["产出指标"][:1],
                效益指标=指标数据["效益指标"][:1],
                满意度指标=指标数据["满意度指标"][:1],
            ).as_dict(),
            "预算明细": 预算明细Data().as_dict(),
        }
        基本信息 = 汇总立项info02["基本信息"]
        logger.info(f"项目立项开启论证:{汇总立项info02}")
        项目立项02 = fill_项目立项(oc_page, oc_page_backup, 基本信息, 汇总立项info02, 用户名, 是否明确资金来源="否")
    with 测试步骤("项目汇总"):
        logger.info(f"汇总的两个项目:{项目立项01},{项目立项02}")
        oc_page.项目汇总页.fill_项目汇总()
