from src.test_cases import *
from src.test_cases.项目管理 import fill_项目论证, fill_项目立项


@用例名称("直接立项提交审批通过")
@用例描述(
    """
测试立项论证新增审批功能
    项目立项=>项目论证
测试步骤:
1. 创建项目立项并审批通过
2. 新增立项论证,并审批通过
5. 验证审批结果
"""
)
@用例级别(严重)
def test_立项论证新增审批(oc_page, oc_page_backup, 基础配置):
    with 测试步骤("项目立项并审批"):
        用户名 = "Atest7"
        基本项目类型 = 基础配置["项目类型"]["基本项目类型"]
        基本类型立项info = {
            "基本信息": 项目立项基本信息Data(
                项目类型=基本项目类型,
                实施部门="一级部门",
                经费类型="创收经费",
                项目层级="【全部】",
                立项方式="年度统一立项",
                是否政府投资类="否",
            ).as_dict(),
            "立项信息": 立项信息Data(是否立项论证="是").as_dict(),
        }
        基本信息 = 基本类型立项info["基本信息"]
        logger.info(f"项目概算_项目立项:{基本类型立项info}")
        项目立项 = fill_项目立项(oc_page, oc_page_backup, 基本信息, 基本类型立项info, 用户名)
    with 测试步骤("项目论证"):
        立项论证info = {
            "立项论证信息": 立项论证信息().as_dict(),
            "论证项目明细": [论证项目明细(项目编码=项目立项, 立项论证结果="不通过", 不通过项目处置="清理库").as_dict()],
        }
        logger.info(f"立项论证表单信息:{立项论证info}")
        fill_项目论证(oc_page, oc_page_backup, 立项论证info, "Atest7")
