from src.test_cases import *


@用例名称("直接立项提交审批通过")
@用例描述(
    """
测试项目直接立项提交审批功能

测试步骤:
1. 立项人员角色登录
2. 填写直接立项信息
3. 提交审批
4. 审批通过
5. 验证审批结果
"""
)
@用例级别(严重)
def test_直接立项新增审批(oc_page, oc_page_backup, 基础配置):
    with 测试步骤("数据初始化"):
        登录用户名 = "Atest5"
        指标数据, ALL项目类型 = 基础配置["绩效指标库"], 基础配置["项目类型"]["ALL_项目类型"]
        直接立项info = {
            "基本信息": 项目立项基本信息Data(
                项目类型=ALL项目类型,
                实施部门="一级部门",
                经费类型="创收经费",
                项目层级="【全部】",
                是否政府投资类="是",
                项目前期文档="项目建议书&&项目可行性报告&&项目概算",
                项目负责人="一级部门A_负责人",
            ).as_dict(),
            "立项信息": 立项信息Data().as_dict(),
            "采购项目专项": {
                "采购信息": 采购信息Data().as_dict(),
                "购置明细": [
                    购置明细Data(采购品目名称=c["采购品目名称"], 采购品目编码=c["采购品目编码"]).as_dict()
                    for c in [
                        {"采购品目名称": "工程类\构筑物施工\桥梁工程施工\铁路桥梁工程施工", "采购品目编码": "B020701"},
                        {"采购品目名称": "工程类\构筑物施工\桥梁工程施工\公路桥梁工程施工", "采购品目编码": "B020702"},
                        {
                            "采购品目名称": "工程类\构筑物施工\桥梁工程施工\城市道路桥梁工程施工",
                            "采购品目编码": "B020703",
                        },
                    ]
                ],
            },
            "建设项目专项信息": {
                "工程建设信息": 工程建设信息Data().as_dict(),
                "施工区域及位置": [施工区域及位置Data().as_dict()],
            },
            "科研项目专项信息": {
                "科研项目信息": 科研项目信息Data().as_dict(),
                "项目负责人信息": 项目负责人信息Data().as_dict(),
                "项目组成员": [项目组成员信息Data().as_dict()],
            },
            "教学管理项目专项信息": {
                "主导人信息": 主导人信息Data().as_dict(),
                "项目组成员信息": [项目组成员Data().as_dict()],
                "立项依据和目标": 立项依据和目标Data().as_dict(),
            },
            "项目专项信息": {
                "主导人信息": 主导人信息Data().as_dict(),
                "项目组成员": [项目专项信息_项目组成员Data().as_dict()],
                "立项依据和目标": 立项依据和目标Data().as_dict(),
            },
            "绩效目标": 绩效目标Data(
                产出指标=指标数据["产出指标"][:2],
                效益指标=指标数据["效益指标"][:2],
                满意度指标=指标数据["满意度指标"][:2],
            ).as_dict(),
            "预算明细": 预算明细Data().as_dict(),
            "执行任务": {"项目计划分解": [项目计划分解Data(任务阶段=f"第{i + 1}任务阶段").as_dict() for i in range(3)]},
            "验收标准": {"验收标准说明": {"验收标准说明": faker_text(50)}, "验收信息": [验收标准Data().as_dict()]},
            "成果物": {"成果物说明": {"成果物说明": faker_text(50)}, "成果物详情": [成果物Data().as_dict()]},
        }
        项目基本信息 = 直接立项info["基本信息"]
    with 测试步骤("项目管理人员登录,跳转到立项申请"):
        oc_page.立项申请页.set_设置当前用户为(登录用户名)
        oc_page.立项申请页.navigate()
    with 测试步骤("填写立项基本信息"):
        oc_page.立项申请页.click_button("直接立项")
        oc_page.立项申请页.fill_立项基本信息(项目基本信息)
        logger.info(直接立项info)
    with 测试步骤("填写详细数据并校验"):
        oc_page.立项申请页.fill_项目立项tab信息(
            直接立项info,
            year=项目基本信息.get("项目周期"),
            项目立项方式=项目基本信息["立项方式"],
            temp_path=oc_page.log_dir,
        )
        oc_page.立项申请页.click_button("提交")
        oc_page.立项申请页.confirm_弹框()
        error_message = oc_page.立项申请页.wait_for_error_message()
        if error_message:
            logger.warning(f"立项提交报错信息: {error_message}")

        项目信息 = oc_page.立项申请页.search_立项信息(项目基本信息["项目名称"])
        assert "审批中" in 项目信息.get("审批状态")
    with 测试步骤("审批通过"):
        oc_page_backup.我的待办.set_设置当前用户为("testUser")
        oc_page_backup.我的待办.navigate()
        oc_page_backup.我的待办.审批同意("立项申请", 登录用户名)
        项目信息 = oc_page.立项申请页.search_立项信息(项目基本信息["项目名称"])
        assert "已审批" in 项目信息.get("审批状态")


@用例名称("需求立项")
@用例描述(
    """
测试需求立项功能
测试步骤:
1. 立项人员角色登录
2. 创建需求并审批通过
2. 填写需求立项信息并审批通过
4. 验证保存结果
"""
)
@用例级别(严重)
def test_需求立项新增审批(oc_page, oc_page_backup, 关联需求, 基础配置, global_map):
    with 测试步骤("数据初始化"):
        登录用户名 = "Atest6"
        需求名称 = 关联需求(登录用户名)
        指标数据, ALL项目类型 = 基础配置["绩效指标库"], 基础配置["项目类型"]["ALL_项目类型"]
        直接立项info = {
            "基本信息": 项目立项基本信息Data(
                项目类型=ALL项目类型,
                实施部门="一级部门",
                经费类型="创收经费",
                项目层级="【全部】",
                是否政府投资类="是",
                项目前期文档="项目建议书&&项目可行性报告&&项目概算",
                项目负责人="一级部门A_负责人",
                关联需求=需求名称,
            ).as_dict(),
            "立项信息": 立项信息Data().as_dict(),
            "采购项目专项": {
                "采购信息": 采购信息Data().as_dict(),
                "购置明细": [
                    购置明细Data(采购品目名称=c["采购品目名称"], 采购品目编码=c["采购品目编码"]).as_dict()
                    for c in [
                        {"采购品目名称": "工程类\构筑物施工\桥梁工程施工\铁路桥梁工程施工", "采购品目编码": "B020701"},
                        {"采购品目名称": "工程类\构筑物施工\桥梁工程施工\公路桥梁工程施工", "采购品目编码": "B020702"},
                        {
                            "采购品目名称": "工程类\构筑物施工\桥梁工程施工\城市道路桥梁工程施工",
                            "采购品目编码": "B020703",
                        },
                    ]
                ],
            },
            "建设项目专项信息": {
                "工程建设信息": 工程建设信息Data().as_dict(),
                "施工区域及位置": [施工区域及位置Data().as_dict()],
            },
            "科研项目专项信息": {
                "科研项目信息": 科研项目信息Data().as_dict(),
                "项目负责人信息": 项目负责人信息Data().as_dict(),
                "项目组成员": [项目组成员信息Data().as_dict()],
            },
            "教学管理项目专项信息": {
                "主导人信息": 主导人信息Data().as_dict(),
                "项目组成员信息": [项目组成员Data().as_dict()],
                "立项依据和目标": 立项依据和目标Data().as_dict(),
            },
            "项目专项信息": {
                "主导人信息": 主导人信息Data().as_dict(),
                "项目组成员": [项目专项信息_项目组成员Data().as_dict()],
                "立项依据和目标": 立项依据和目标Data().as_dict(),
            },
            "绩效目标": 绩效目标Data(
                产出指标=指标数据["产出指标"][:2],
                效益指标=指标数据["效益指标"][:2],
                满意度指标=指标数据["满意度指标"][:2],
            ).as_dict(),
            "预算明细": 预算明细Data().as_dict(),
            "执行任务": {"项目计划分解": [项目计划分解Data(任务阶段=f"第{i + 1}任务阶段").as_dict() for i in range(3)]},
            "验收标准": {"验收标准说明": {"验收标准说明": faker_text(50)}, "验收信息": [验收标准Data().as_dict()]},
            "成果物": {"成果物说明": {"成果物说明": faker_text(50)}, "成果物详情": [成果物Data().as_dict()]},
        }
        项目基本信息 = 直接立项info["基本信息"]
    with 测试步骤("项目管理人员登录,跳转到立项申请"):
        oc_page.立项申请页.set_设置当前用户为(登录用户名)
        oc_page.立项申请页.navigate()
    with 测试步骤("填写需求立项信息"):
        oc_page.立项申请页.click_button("需求立项")
        oc_page.立项申请页.fill_立项基本信息(项目基本信息)
        oc_page.立项申请页.fill_项目立项tab信息(
            tab信息=直接立项info,
            year=项目基本信息.get("项目周期"),
            项目立项方式=项目基本信息["立项方式"],
            temp_path=oc_page.log_dir,
        )
    with 测试步骤("验证提交结果"):
        oc_page.立项申请页.click_button("提交")
        oc_page.立项申请页.confirm_弹框()
        error_message = oc_page.立项申请页.wait_for_error_message()
        if error_message:
            logger.warning(f"立项提交报错信息: {error_message}")

        项目信息 = oc_page.立项申请页.search_立项信息(项目基本信息["项目名称"])
        assert "审批中" in 项目信息.get("审批状态")
    with 测试步骤("审批通过验证"):
        oc_page_backup.我的待办.set_设置当前用户为("testUser")
        oc_page_backup.我的待办.navigate()
        oc_page_backup.我的待办.审批同意("立项申请", 登录用户名)
        项目信息 = oc_page.立项申请页.search_立项信息(项目基本信息["项目名称"])
        assert "已审批" in 项目信息.get("审批状态")
