from src.test_cases import *
from src.test_cases.项目管理.conftest import fill_项目立项, 项目立项_临时立项_项目论证
from src.test_cases.项目管理.项目立项.conftest import fill_备选库


@用例名称("临时立项项目库处置")
@用例描述(
    """
    临时立项(明确资金来源)：核通过后-论证，论证通过直接到执行。
    临时立项(否明确资金来源)：核通过后-论证，论证通过直接到备选。
测试步骤:
1. 项目临时立项项目论证为是，通过审批
2. 项目论证通过
3. 备选库处理
"""
)
@用例级别(严重)
def test_临时立项_论证_备选库管理处置(oc_page, oc_page_backup, 基础配置):
    with 测试步骤("数据初始化"):
        测试用户 = "Atest9"
        论证通过_临时立项 = 项目立项_临时立项_项目论证(
            oc_page, oc_page_backup, 基础配置, 测试用户, 是否明确资金来源="否"
        )
        项目处置info = {
            "处置方式": random.choice(["清理库", "立项退回"]),
            "处置理由": faker_text(50),
        }
        logger.info(f"备选库处置方式信息: {项目处置info}")
    with 测试步骤("备选库处置"):
        fill_备选库(oc_page, 论证通过_临时立项, 项目处置info, 测试用户)


@用例名称("年度立项项目库处置")
@用例描述(
    """
 年度立项：审核通过-论证-备选-预算生成指标-到执行。
测试步骤:
1. 项目年度立项项目论证为否，通过审批
2. 备选库处理
"""
)
@用例级别(普通)
def test_年度立项_备选库管理处置(oc_page, oc_page_backup, 基础配置):
    with 测试步骤("项目立项(年度统一立项)"):
        测试用户 = "Atest8"
        基本项目类型 = 基础配置["项目类型"]["基本项目类型"]
        基本类型立项info = {
            "基本信息": 项目立项基本信息Data(
                项目名称=f"自动化创建_备选库管理_{faker_随机数生成(3)}",
                项目类型=基本项目类型,
                实施部门="一级部门",
                经费类型="创收经费",
                项目层级="【全部】",
                立项方式="年度统一立项",
                是否政府投资类="否",
                项目负责人="一级部门A_负责人",
            ).as_dict(),
            "立项信息": 立项信息Data(是否立项论证="否").as_dict(),
        }
        基本信息 = 基本类型立项info["基本信息"]
        logger.info(f"备选库管理_项目立项:{基本类型立项info}")
        项目立项_年度统一立项 = fill_项目立项(oc_page, oc_page_backup, 基本信息, 基本类型立项info, 测试用户)
    with 测试步骤("数据初始化"):
        项目处置info = {
            "处置方式": random.choice(["清理库", "立项退回"]),
            "处置理由": faker_text(50),
        }
        logger.info(f"备选库处置方式信息: {项目处置info}")
        fill_备选库(oc_page, 项目立项_年度统一立项, 项目处置info, 测试用户)
